# -*- mode: ruby -*-
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'homebrew/dupes'

# brew 'the_silver_searcher'
# brew 'z'
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'git'
brew 'stow'
brew 'hub'
brew 'curl'
brew 'autoconf'
brew 'automake'
brew 'gcc'
brew 'gawk'
brew 'openssl'
brew 'tree'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'zlib'
brew 'tmux'
brew 'gettext'
brew 'python', args: ['--framework']
brew 'rbenv', args: ['--HEAD']
brew 'ruby-build'
brew 'gnu-sed', args: ['--with-default-names']
brew 'bash'
brew 'bash-completion'
brew 'wget', args: ['--with-iri']

# mac apps
# cask 'heroku-toolbelt'
# cask 'font-dejavu-sans'
# cask 'font-inconsolata'
# cask 'sizeup'
# cask 'little-snitch'
# cask 'dash'
# cask 'istat-menus'
# cask 'macvim'
# cask 'dropbox'
# cask 'emacs'
# cask 'skitch'
# cask 'virtualbox'
# cask 'vagrant'
cask 'google-chrome'
cask 'monotype-skyfonts'
cask 'spotify'
cask 'evernote'
cask 'iterm2'
cask 'java'
cask 'intellij-idea'
cask 'colors'
cask 'bartender'
cask 'insomniaX'
cask 'the-unarchiver'
cask 'haskell-platform'
cask 'hammerspoon'
cask 'visual-studio-code'
