# -*- mode: ruby -*-
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'homebrew/dupes'

brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'git'
brew 'stow'
brew 'hub'
brew 'curl'
brew 'autoconf'
brew 'automake'
brew 'gcc'
brew 'gawk'
brew 'openssl'
brew 'tree'
brew 'readline'
brew 'docker'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'reattach-to-user-namespace'
brew 'zlib'
brew 'tmux'
brew 'z'
brew 'gettext'
# brew 'mackup'
brew 'python', args: ['--framework']
brew 'rbenv', args: ['--HEAD']
brew 'ruby-build'
brew 'gnu-sed', args: ['--with-default-names']
brew 'bash'
brew 'bash-completion'
brew 'wget', args: ['--with-iri']
brew 'p7zip'
brew 'ssh-copy-id'

# mac apps
# cask 'heroku-toolbelt'
# cask 'font-dejavu-sans'
# cask 'font-inconsolata'
# cask 'sizeup'
# cask 'little-snitch'
# cask 'dash'
# cask 'istat-menus'
cask 'macvim'
cask 'google-chrome'
cask 'dropbox'
cask 'emacs'
cask 'monotype-skyfonts'
cask 'spotify'
cask 'evernote'
cask 'skitch'
cask 'iterm2'
cask 'virtualbox'
cask 'vagrant'
cask 'java'
cask 'intellij-idea'
cask 'colors'
cask 'karabiner'
cask 'bartender'
cask 'caffeine'
cask 'insomniaX'
cask 'menumeters'
cask 'sourcetree'
cask 'the-unarchiver'
