# -*- mode: ruby -*-
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/dev-tools'
tap 'homebrew/bundle'
tap 'homebrew/services'

# Unsure of this
# cask_args appdir: "~/Applications"

brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnupg'
brew 'git'
brew 'git-lfs'
brew 'git-crypt'
brew 'vim'
brew 'openssl'
brew 'haskell-stack'
brew 'curl'
brew 'tmate'
brew 'wget'

# mac apps
cask 'firefox'
cask 'brave-browser'
cask 'iterm2'
cask 'visual-studio-code'
cask 'gpg-suite'
cask 'bartender'
cask 'telegram'
cask 'whatsapp'
cask 'discord'
cask 'riot'
cask 'keybase'
cask '1password'
cask 'github'
cask 'osxfuse'
cask 'postman'
cask 'docker'
cask 'java'
cask 'the-unarchiver'
cask 'insomniaX'